app/Controllers/Home.php

SELECT *
FROM `kategori`
SELECT *
FROM `produk`
JOIN `status` ON `status`.`id_status` = `produk`.`status_id`
WHERE `status`.`nama_status` = 'tidak bisa dijual'
SELECT *
FROM `produk`
JOIN `status` ON `status`.`id_status` = `produk`.`status_id`
WHERE `status`.`nama_status` = 'bisa dijual'
---
    public function index(): string
    {
        // deklarasi model
        $modelkategori = new KategoriModel();
        $modelproduk = new ProdukModel();
        // mengambil data kategori
        $kategori = $modelkategori->findAll();

        // mengambil data produk dengan status tidak bisa dijual
        $produk_tidak_dijual = $modelproduk->join('status', 'status.id_status = produk.status_id')->where('status.nama_status', 'tidak bisa dijual')->findAll();


        // mengambil data produk dengan status bisa dijual
        $produk_dijual = $modelproduk->join('status', 'status.id_status = produk.status_id')->where('status.nama_status', 'bisa dijual')->findAll();