app/Controllers/ProductController.php

SELECT *
FROM `produk`
JOIN `status` ON `status`.`id_status` = `produk`.`status_id`
JOIN `kategori` ON `kategori`.`id_kategori` = `produk`.`kategori_id`
WHERE `status`.`nama_status` = 'bisa dijual'
ORDER BY `id_produk` DESC
 LIMIT 10, 10
SELECT COUNT(*) AS `numrows`
FROM `produk`
JOIN `status` ON `status`.`id_status` = `produk`.`status_id`
JOIN `kategori` ON `kategori`.`id_kategori` = `produk`.`kategori_id`
WHERE `status`.`nama_status` = 'bisa dijual'
SELECT *
FROM `produk`
JOIN `status` ON `status`.`id_status` = `produk`.`status_id`
JOIN `kategori` ON `kategori`.`id_kategori` = `produk`.`kategori_id`
WHERE `status`.`nama_status` = 'tidak bisa dijual'
ORDER BY `id_produk` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `produk`
JOIN `status` ON `status`.`id_status` = `produk`.`status_id`
JOIN `kategori` ON `kategori`.`id_kategori` = `produk`.`kategori_id`
WHERE `status`.`nama_status` = 'tidak bisa dijual'
SELECT *
FROM `produk`
JOIN `kategori` ON `kategori`.`id_kategori` = `produk`.`kategori_id`
JOIN `status` ON `status`.`id_status` = `produk`.`status_id`
ORDER BY `id_produk` DESC
 LIMIT 20, 10
SELECT COUNT(*) AS `numrows`
FROM `produk`
JOIN `kategori` ON `kategori`.`id_kategori` = `produk`.`kategori_id`
JOIN `status` ON `status`.`id_status` = `produk`.`status_id`
---
    public function index(): string
    {
        // dd($_GET['filter']);
        $modelproduk = new ProdukModel();
        if(isset($_GET['filter']) && $_GET['filter'] == 'dapat di jual'){
            $data['produk'] = $modelproduk->join('status', 'status.id_status = produk.status_id')->where('status.nama_status', 'bisa dijual')
            ->join('kategori', 'kategori.id_kategori = produk.kategori_id')
            ->orderBy('id_produk', 'DESC')
            ->paginate(10);

            $data['filter'] = 'dapat di jual';
        }else if(isset($_GET['filter']) && $_GET['filter'] == 'tidak dapat di jual'){
            $data['produk'] = $modelproduk->join('status', 'status.id_status = produk.status_id')->where('status.nama_status', 'tidak bisa dijual')
            ->join('kategori', 'kategori.id_kategori = produk.kategori_id')
            ->orderBy('id_produk', 'DESC')
            ->paginate(10);

            $data['filter'] = 'tidak dapat di jual';
        }else{
            $data['produk'] = $modelproduk->join('kategori', 'kategori.id_kategori = produk.kategori_id')
            ->join('status', 'status.id_status = produk.status_id')
            ->orderBy('id_produk', 'DESC')
            ->paginate(10);

SELECT *
FROM `kategori`
SELECT *
FROM `status`
---
    public function create() : string
    {
        $modelkategori = new KategoriModel();
        $modelstatus = new StatusModel();

        $data = [
            'title' => 'Tambah Produk',
            'page' => 'dashboard',
            'kategori' => $modelkategori->findAll(),
            'status' => $modelstatus->findAll()

INSERT INTO `produk` (`nama_produk`, `harga`, `status_id`, `kategori_id`) VALUES ('TISU ', 10000, 2, 1)
---
    public function store()
    {
        $modelproduk = new ProdukModel();

        $data = [
            'nama_produk' => $this->request->getPost('nama_produk'),
            'harga' => intval($this->request->getPost('harga_produk')),
            'status_id' => intval($this->request->getPost('status_produk')),
            'kategori_id' => intval($this->request->getPost('kategori_produk')),
        ];

        $modelproduk->insert($data);

SELECT *
FROM `produk`
JOIN `status` ON `status`.`id_status` = `produk`.`status_id`
JOIN `kategori` ON `kategori`.`id_kategori` = `produk`.`kategori_id`
WHERE `produk`.`id_produk` = '81'
 LIMIT 1
SELECT *
FROM `kategori`
SELECT *
FROM `status`
---
    public function edit($id)
    {
        $modelproduk = new ProdukModel();
        $modelkategori = new KategoriModel();
        $modelstatus = new StatusModel();

        $produkid = $modelproduk->join('status', 'status.id_status = produk.status_id')
        ->join('kategori', 'kategori.id_kategori = produk.kategori_id')
        ->where('produk.id_produk', $id)
        ->first();

        $data = [
            'title' => 'Edit Produk',
            'page' => 'Edit Produk',
            'produk' => $produkid,
            'kategori' => $modelkategori->findAll(),
            'status' => $modelstatus->findAll()

SELECT *
FROM `produk`
WHERE `produk`.`id_produk` = '81'
UPDATE `produk` SET `id_produk` = '81', `nama_produk` = 'TISU ', `harga` = 15000, `status_id` = 1, `kategori_id` = 1
WHERE `produk`.`id_produk` IN ('81')
---
    public function update()
    {
        try{
            $modelproduk = new ProdukModel();

            // check apakah id produk ada atau tidak
            $produk = $modelproduk->find($this->request->getPost('id_produk'));
            if (!$produk) {
                session()->setFlashdata('message', 'Data Produk Tidak Ditemukan');
                return redirect()->to('/produk');
            }

            $data = [
                'id_produk' => $this->request->getPost('id_produk'),
                'nama_produk' => $this->request->getPost('nama_produk'),
                'harga' => intval($this->request->getPost('harga_produk')),
                'status_id' => intval($this->request->getPost('status_produk')),
                'kategori_id' => intval($this->request->getPost('kategori_produk')),
            ];

            // check apakah ada perubahan data
            if(
                $data['nama_produk'] == $produk['nama_produk'] &&
                $data['harga'] == $produk['harga'] &&
                $data['status_id'] == $produk['status_id'] &&
                $data['kategori_id'] == $produk['kategori_id']
            ){
                session()->setFlashdata('message', 'Data Produk Tidak Ada Perubahan');
                return redirect()->to('/produk');
            }else{
                $modelproduk->update($data['id_produk'], $data);

DELETE FROM `produk`
WHERE `id_produk` IN ('81')
---
    public function delete()
    {
        try{
            $modelproduk = new ProdukModel();
            $modelproduk->delete($this->request->getPost('id_produk'));